title: Out-of-Range IOA
id: 02e00019-e0f4-4200-add3-f8a3542e5d9f
description: Detects IEC-104 messages containing IOA values outside the valid configured range for the RTU.
status: test
author: sigurdog
# date: xxxx/xx/xx

logsource:
  product: network
  service: ids

fields:
  - source_ip
  - destination_ip
  - iec104.ioa

detection:
  ioa_present:
    iec104.ioa|exists: true

  invalid_ioa:
    iec104.ioa|int:
      - "<0"
      - ">2048"     # Tilpass til RTUens faktiske IOA-range

  condition: ioa_present and invalid_ioa

falsepositives:
  - Misconfiguration