title: Out-of-Range IOA
id: xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx #Der x er hex (0–9, a–f), og y er 8, 9, a eller b.
description: Detects IEC-104 messages containing IOA values outside the valid configured range for the RTU.
status: test
author: sigurdog
# date: xxxx/xx/xx

logsource:
  product: network
  service: ids

detection:
  ioa_present:
    iec104.ioa|exists: true

  invalid_ioa:
    iec104.ioa|int:
      - "<0"
      - ">9999"     # Tilpass til RTUens faktiske IOA-range

  condition: ioa_present and invalid_ioa

fields:
  - source_ip
  - destination_ip
  - iec104.ioa

falsepositives:
  - Misconfiguration

level: high

tags: 