title: Invalid or Unexpected TypeID
id: fd8b35e3-5a34-49ae-bb18-9299b5a5f564
description: Detects IEC-104 traffic first with TypeID present, and a valid TypeID
  in range 1-127. In this rule there are some specific allowed TypeIDs (1,3,5,9,11,13)
  meaning any other then these will be unexpected.
status: test
author: sigurdog
date: 2026/04/25

logsource:
  product: network
  service: ids

fields:
  - source_ip
  - destination_ip
  - iec104.typeid

tags:
  -
detection:
  typeid_present:
    iec104.typeid|exists: true

  invalid_typeid:
    iec104.typeid|int:
      - "<1"
      - ">127"

  allowed_typeids:
    iec104.typeid:
      - 1    # M_SP_NA_1
      - 3    # M_DP_NA_1
      - 5    # M_ST_NA_1
      - 9    # M_ME_NA_1
      - 11   # M_ME_NB_1
      - 13   # M_ME_NC_1

  unexpected_typeid:
    condition: typeid_present and not allowed_typeids

  condition: invalid_typeid or unexpected_typeid

falsepositives:
  - Misconfiguration