title: Invalid or Unexpected TypeID
id: xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx #Der x er hex (0-9, a-f), og y er 8, 9, a eller b.
description: Detects IEC-104 traffic containing invalid, unexpected, or role-inconsistent
  TypeIDs. Includes TypeID outside 1-127, command types sent from slaves, or
  TypeIDs not part of the RTU's expected dataset.
status: test
author: sigurdog
# date: xxxx/xx/xx

logsource:
  product: network
  service: ids

detection:
  typeid_present:
    iec104.typeid|exists: true

  invalid_typeid:
    iec104.typeid|int:
      - "<1"
      - ">127"

  allowed_typeids:
    iec104.typeid:
      - 1    # M_SP_NA_1
      - 3    # M_DP_NA_1
      - 5    # M_ST_NA_1
      - 9    # M_ME_NA_1
      - 11   # M_ME_NB_1
      - 13   # M_ME_NC_1
      # legg inn riktige TypeIDs for din RTU

  unexpected_typeid:
    condition: typeid_present and not allowed_typeids

  command_types:
    iec104.typeid|in:
      - 45   # C_SC_NA_1
      - 46   # C_DC_NA_1
      - 47   # C_RC_NA_1
      - 48   # C_SE_NA_1
      - 49   # C_SE_NB_1
      - 50   # C_SE_NC_1

  from_slave:
    source_ip|in:
      - "<IP>"
      - "<IP>"
      # legg inn RTU IPs

  command_from_slave:
    condition: command_types and from_slave

  condition: invalid_typeid or unexpected_typeid or command_from_slave

fields:
  - source_ip
  - destination_ip
  - iec104.typeid

falsepositives:
  - None expected unless TypeID ranges or RTU profiles are misconfigured.

level: high

tags:
  -