title: Non-IEC-104 Traffic on Port 2404
id: 2f6b28fa-e2cb-4cf5-a4e6-9d7a56b77c21
description: Detects TCP traffic on the IEC-104 default port 2404 that
  does not have an ASDU type indicating protocol misuse, or scanning activity.
status: test
author: sigurdog
date: 2026/04/25

logsource:
  product: network
  service: ids

detection:
  port_2404:
    id.resp_p: 2404

  tcp_proto:
    proto: tcp

  no_iec104_asdu:
    asdu_type|exists: false

  condition: port_2404 and tcp_proto and no_iec104_asdu

falsepositives:
  - Port scans
  - Connection attempts without application data
