title: IEC-104 Port Misuse or Abnormal TCP Session Patterns
id: 03781f27-3b4c-4e36-8127-8827fbfda0e3
description: Detects IEC-104-like traffic on ports that is not the default 2404
status: test
author: sigurdog
date: 2026/04/22

logsource:
  category: network_traffic
  product: network
  service: ids

fields:
  - src_ip
  - dest_ip
  - dest_port

tags:
  - attack.t1040
  - attack.t1046

detection:
  iec104_traffic:
    proto: TCP
    src_ip: "10.20.0.124"      # Master IP
    dest_ip: "10.20.0.133" # Slave IP

  port_2404:
    dest_port: 2404

  condition: iec104_traffic and not port_2404

falsepositives:
  - Redundant/failover using alternative ports