title: Source Impersonation
id: eec64d18-00fe-4306-adaa-81a4be0550bd
description: Detects communication attempts from unknown or
  unauthorized master devices. RTUs should only communicate with a single
  predefined master.
status: test
author: sigurdog
date: 2026/04/19

#references:
 # - <URL>
logsource:
  product: network
  service: ids

tags:
  - attack.lateral-movement
  - attack.credential-access

fields:
 - src_ip
 - dest_ip
 - dest_port

detection:
  iec104_port:
    destination_port: 2404
    protocol: tcp

  unknown_master:
    source_ip:
      - "10.20.0.124" # SCADA Master

  condition: iec104_port and not unknown_master

falsepositives:
  - Testing
  - Legacy multi-master architecture (rare)

