title: Source Impersonation 
id: xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx #Der x er hex (0–9, a–f), og y er 8, 9, a eller b.
description: Detects communication attempts from unknown or
  unauthorized master devices. RTUs should only communicate with a single 
  predefined master. 
status: test
author: sigurdog
# date: xxxx/xx/xx
references:
  - <URL>
logsource:
    product: network
    service: ids
detection:
    iec104_port:
        destination_port: 2404
        protocol: tcp

unknown_master:
    source_ip|neq:
      - "x.x.x.x" # SCADA Master 

    condition: iec104_port and known_masters and iec104_command

fields:
 - source_ip
 - destination_ip
 - destination_port

falsepositives:
  - Testing
  - Legacy multi-master architecture (rare)

level: high

tags:
  - 