title: IEC-104 Suspicious Cause of Transmission
id: 22a8a4f4-cd47-4633-8c15-593790bf7ce0
description: Detects IEC-104 frames with a COT value outside the normal set {1,3,6,7},
  often used in spoofing or malformed attack traffic.
status: test
author: sigurdog
date: 2026/04/25

logsource:
  product: network
  service: ids

fields:
  - source_ip
  - destination_ip
  - iec104.cot

tags:
  -
detection:
  valid_cot:
    iec104.cot:
      - 1
      - 3
      - 6
      - 7

  cot_field_present:
    iec104.cot|exists: true

  condition: cot_field_present and not valid_cot

falsepositives:
  - Unknown