title: IEC-104 Invalid or Suspicious Cause of Transmission
id: xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx #Der x er hex (0-9, a-f), og y er 8, 9, a eller b.
description: Detects IEC-104 frames with a COT value outside the normal set {1,3,6,7},
  often used in spoofing or malformed attack traffic.
status: test
author: sigurdog
# date: xxxx/xx/xx

logsource:
  product: network
  service: ids

detection:
  valid_cot:
    iec104.cot:
      - 1
      - 3
      - 6
      - 7

  cot_field_present:
    iec104.cot|exists: true

  condition: cot_field_present and not valid_cot

fields:
  - source_ip
  - destination_ip
  - iec104.cot

falsepositives:
  - Unknown

level: high

tags:
  -